app/views/recipes/show.html.erb

  <strong class="bold">Tags:</strong>
  <% @recipe.tags.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE "tags"."recipe_id" = $1  [["recipe_id", 1]]