app/controllers/recipes_controller.rb

  def add_tag
    @recipe = Recipe.find(params[:id])
    newTag = Tag.new(params[:tag])
    @tag = newTag.id
    if newTag.valid?
      newTag.save
      @recipe.tags << newTag
      @recipe.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "myTag"], ["created_at", "2015-10-27 21:37:40.095948"], ["updated_at", "2015-10-27 21:37:40.095948"]]
UPDATE "tags" SET "recipe_id" = $1, "updated_at" = $2 WHERE "tags"."id" = $3  [["recipe_id", 1], ["updated_at", "2015-10-27 21:37:40.100332"], ["id", 1]]

  def index
    @recipes = Recipe.all.order("-average_rating ASC")
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."rating" = $1  [["rating", "{}"]]

  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("title", "author", "ingredients", "instructions", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def rating
    @recipe = Recipe.find(params[:id])
    rating_form = params[:rating_form].to_i
    @recipe.rating << rating_form
    @recipe.average_rating = @recipe.rating.sum.to_f / @recipe.rating.length.to_f
    @recipe.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "rating" = $1, "average_rating" = $2, "updated_at" = $3 WHERE "recipes"."id" = $4  [["rating", "{1}"], ["average_rating", 1.0], ["updated_at", "2015-10-29 22:44:56.479594"], ["id", 1]]